import { mocksAxios } from "../mockAPI";
import { Route1, Route2, Route3, Route4 } from 'assets/routes';
import { Worker1, Worker2, Worker3, Worker4, Worker5, Worker6, Worker7 } from 'assets/workers'
import { RoomImage } from 'assets/room';

export const mockHomeAPI = {
    getLanguages: () =>
        mocksAxios.onGet("/").reply(200, [
            {
                id: 1,
                content: 'BLR'
            },
            {
                id: 2,
                content: 'ENG'
            },
            {
                id: 3,
                content: 'RUS'
            }
        ]),
    getRoutesList: () =>
        mocksAxios.onGet("/").reply(200, [
            {
                id: 1,
                img: `../${Route1}`,
                name: 'Маршрут по историческим местам',
                description: 'Гістарычны цэнтр горада 1',
                aboutRoute: 'Другі раз яны сустрэліся ў Гродне ў снежні 1887 года. З гэтага часу паміж імі завязалася сяброўства. Яны ліставаліся, часта наведвалі адзін аднаго. Ён бываў частым госцем ў доме Ажэшкі каля Сеннай плошчы, а з 1895 г. заяжджаў і ў дом Станіслава',
                mainImg: `../${RoomImage}`,
                countLike: 0,
            },
            {
                id: 2,
                img: `../${Route2}`,
                name: 'Маршрут по религиозным местам',
                description: 'Гістарычны цэнтр горада 2',
                aboutRoute: 'Другі раз яны сустрэліся ў Гродне ў снежні 1887 года. З гэтага часу паміж імі завязалася сяброўства. Яны ліставаліся, часта наведвалі адзін аднаго. Ён бываў частым госцем ў доме Ажэшкі каля Сеннай плошчы, а з 1895 г. заяжджаў і ў дом Станіслава',
                mainImg: `../${RoomImage}`, countLike: 0,
            },
            {
                id: 3,
                img: `../${Route3}`,
                name: 'Маршрут для молодежи',
                description: 'Гістарычны цэнтр горада 3',
                aboutRoute: 'Другі раз яны сустрэліся ў Гродне ў снежні 1887 года. З гэтага часу паміж імі завязалася сяброўства. Яны ліставаліся, часта наведвалі адзін аднаго. Ён бываў частым госцем ў доме Ажэшкі каля Сеннай плошчы, а з 1895 г. заяжджаў і ў дом Станіслава',
                mainImg: `../${RoomImage}`, countLike: 0,
            },
            {
                id: 4,
                img: `../${Route4}`,
                name: 'Маршрут парки и леса',
                description: 'Гістарычны цэнтр горада 4',
                aboutRoute: 'Другі раз яны сустрэліся ў Гродне ў снежні 1887 года. З гэтага часу паміж імі завязалася сяброўства. Яны ліставаліся, часта наведвалі адзін аднаго. Ён бываў частым госцем ў доме Ажэшкі каля Сеннай плошчы, а з 1895 г. заяжджаў і ў дом Станіслава',
                mainImg: `../${RoomImage}`, countLike: 0,
            }
        ]),
    getWorkersList: () =>
        mocksAxios.onGet("/").reply(200, [
            {
                id: 1,
                img: `../${Worker1}`,
                name: 'Name',
                scope: 'Dev'
            }, {
                id: 2,
                img: `../${Worker2}`,
                name: 'Name',
                scope: 'Dis'
            }, {
                id: 3,
                img: `../${Worker3}`,
                name: 'Name',
                scope: 'Test'
            }, {
                id: 4,
                img: `../${Worker4}`,
                name: 'Name',
                scope: 'Dev'
            }, {
                id: 5,
                img: `../${Worker5}`,
                name: 'Name',
                scope: 'Dev'
            }, {
                id: 6,
                img: `../${Worker6}`,
                name: 'Name',
                scope: 'Dev'
            }, {
                id: 7,
                img: `../${Worker7}`,
                name: 'Name',
                scope: 'Dev'
            }
        ]),
    getAboutHomePage: () =>
        mocksAxios.onGet("/").reply(200, [
            {
                id: 1,
                content: 'Яны былі людзьмі адной эпохі. Абое прайшлі праз выпрабаванні Студзеньскага\n' +
                    '                    паўстання 1863-64 гадоў. Абое прысвяцілі сябе пісьменніцтву. Напэўна, такое\n' +
                    '                    падабенства лёсаў і паспрыяла іх сяброўству.'
            }, {
                id: 2,
                content: 'Яны пазнаёміліся ў студзені 1887 года. Ён прыехаў з Вільні ў Гродна, каб асабіста\n' +
                    '                    ўбачыць знакамітую пісьменніцу. Трохі пазней Ажэшка так апісвала гэту\n' +
                    '                    сустрэчу: “Вельмі прыемна правяла з ім некалькі гадзін. Ён чытаў мне свае\n' +
                    '                    беларускія творы і даў мне нават іх копію з асобным вершыкам, так сама\n' +
                    '                    па-беларуску, да мяне ці для мяне. Ці няпраўда, гэта вельмі прыгожыя рэчы,\n' +
                    '                    маюць яны нейкую асаблівую прывабнасць...”.'
            }, {
                id: 3,
                content: 'Другі раз яны сустрэліся ў Гродне ў снежні 1887 года. З гэтага часу паміж імі завязалася сяброўства.\n' +
                    '                    Яны\n' +
                    '                    ліставаліся, часта наведвалі адзін аднаго. Ён бываў частым госцем ў доме Ажэшкі каля Сеннай плошчы,\n' +
                    '                    а з\n' +
                    '                    1895 г. заяжджаў і ў дом Станіслава Нагорскага на Садовай вуліцы.'
            }
        ]),
};
